Catalogs/РасположениеПазовИРучкиНаФасадах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>РасположениеПазовИРучкиНаФасадах</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БезРучки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКартинки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВСтеклянныхФасадах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеПазов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Стороны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеРучки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗеркальноеПоложение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РасположениеПазовИРучкиНаФасадах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоворотВправо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РасположениеПазовИРучкиНаФасадах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РасположениеПазовИРучкиНаФасадах/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтеклянныеФасады") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасположениеПазовИРучкиНаФасадах.ИмяКартинки
		|ИЗ
		|	Справочник.РасположениеПазовИРучкиНаФасадах КАК РасположениеПазовИРучкиНаФасадах
		|ГДЕ
		|	НЕ РасположениеПазовИРучкиНаФасадах.ИспользуетсяВСтеклянныхФасадах";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ИмяКартинки) Тогда
				
				Элементы[ВыборкаДетальныеЗаписи.ИмяКартинки].Видимость = Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПазовНетРучкаВертикальноВЦентре(Команда)
	
	ОтправитьНазвание("ПазовНетРучкаВертикальноВЦентре");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазовНетРучкаВертикальноПоЦентруСверху(Команда)
	
	ОтправитьНазвание("ПазовНетРучкаВертикальноПоЦентруСверху");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазовНетРучкаВертикальноПоЦентруСнизу(Команда)
	
	ОтправитьНазвание("ПазовНетРучкаВертикальноПоЦентруСнизу");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазовНетРучкаГоризонтальноВЦентре(Команда)
	
	ОтправитьНазвание("ПазовНетРучкаГоризонтальноВЦентре");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазовНетРучкаГоризонтальноПоЦентруСверху(Команда)
	
	ОтправитьНазвание("ПазовНетРучкаГоризонтальноПоЦентруСверху");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазовНетРучкаГоризонтальноПоЦентруСнизу(Команда)
	
	ОтправитьНазвание("ПазовНетРучкаГоризонтальноПоЦентруСнизу");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСверзуРучкаГоризонтальноПоЦентруСнизу(Команда)
	
	ОтправитьНазвание("ПазыСверзуРучкаГоризонтальноПоЦентруСнизу");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСверзуРучкаОтсутствует(Команда)
	
	ОтправитьНазвание("ПазыСверзуРучкаОтсутствует");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСлеваРучкаГоризонтальноПоЦентруСнизу(Команда)
	
	ОтправитьНазвание("ПазыСлеваРучкаГоризонтальноПоЦентруСнизу");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСлеваРучкаВертикальноСправаПоЦентру(Команда)
	
	ОтправитьНазвание("ПазыСлеваРучкаВертикальноСправаПоЦентру");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСлеваРучкаВертикальноСправаСверху(Команда)
	
	ОтправитьНазвание("ПазыСлеваРучкаВертикальноСправаСверху");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСлеваРучкаВертикальноСправаСнизу(Команда)
	
	ОтправитьНазвание("ПазыСлеваРучкаВертикальноСправаСнизу");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСлеваРучкаГоризонтальноПоЦентруСверху(Команда)
	
	ОтправитьНазвание("ПазыСлеваРучкаГоризонтальноПоЦентруСверху");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСлеваРучкаГоризонтальноСправаПоЦентру(Команда)
	
	ОтправитьНазвание("ПазыСлеваРучкаГоризонтальноСправаПоЦентру");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСлеваРучкаГоризонтальноСправаСверху(Команда)
	
	ОтправитьНазвание("ПазыСлеваРучкаГоризонтальноСправаСверху");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСлеваРучкаГоризонтальноСправаСнизу(Команда)
	
	ОтправитьНазвание("ПазыСлеваРучкаГоризонтальноСправаСнизу");
	
КонецПроцедуры

&НаКлиенте
Процедура ПазыСлеваРучкаОтсутствует(Команда)
	
	ОтправитьНазвание("ПазыСлеваРучкаОтсутствует");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНазвание(Имя)
	
	ОповеститьОВыборе(Имя);
	
КонецПроцедуры
